Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.0.110/include/pic32cm1216le00064.h
/** \addtogroup PIC32CM1216LE00064_base Peripheral Base Address Definitions
 *  @{
 */

/* ************************************************************************** */
/*   BASE ADDRESS DEFINITIONS FOR PIC32CM1216LE00064                          */
/* ************************************************************************** */
#define AC_BASE_ADDRESS                  _UL_(0x40003400)                              /* AC Base Address */
#define ADC_BASE_ADDRESS                 _UL_(0x42003800)                              /* ADC Base Address */
#define CCL_BASE_ADDRESS                 _UL_(0x42004800)                              /* CCL Base Address */
#define DAC_BASE_ADDRESS                 _UL_(0x42003c00)                              /* DAC Base Address */
#define DMAC_BASE_ADDRESS                _UL_(0x41006000)                              /* DMAC Base Address */
#define DSU_BASE_ADDRESS                 _UL_(0x41002000)                              /* DSU Base Address */
#define DSU_EXT_BASE_ADDRESS             _UL_(0x41002100)                              /* DSU Base Address */
#define EIC_BASE_ADDRESS                 _UL_(0x40002800)                              /* EIC Base Address */
#define EVSYS_BASE_ADDRESS               _UL_(0x42000000)                              /* EVSYS Base Address */
#define FREQM_BASE_ADDRESS               _UL_(0x40002c00)                              /* FREQM Base Address */
#define GCLK_BASE_ADDRESS                _UL_(0x40001c00)                              /* GCLK Base Address */
#define I2S_BASE_ADDRESS                 _UL_(0x42004c00)                              /* I2S Base Address */
#define MCLK_BASE_ADDRESS                _UL_(0x40000800)                              /* MCLK Base Address */
#define NVMCTRL_BASE_ADDRESS             _UL_(0x41004000)                              /* NVMCTRL Base Address */
#define OPAMP_BASE_ADDRESS               _UL_(0x42005000)                              /* OPAMP Base Address */
#define OSC32KCTRL_BASE_ADDRESS          _UL_(0x40001400)                              /* OSC32KCTRL Base Address */
#define OSCCTRL_BASE_ADDRESS             _UL_(0x40001000)                              /* OSCCTRL Base Address */
#define PAC_BASE_ADDRESS                 _UL_(0x40000000)                              /* PAC Base Address */
#define PM_BASE_ADDRESS                  _UL_(0x40000400)                              /* PM Base Address */
#define PORT_BASE_ADDRESS                _UL_(0x40003000)                              /* PORT Base Address */
#define PORT_IOBUS_BASE_ADDRESS          _UL_(0x60000000)                              /* PORT Base Address */
#define PTC_BASE_ADDRESS                 _UL_(0x42004000)                              /* PTC Base Address */
#define RSTC_BASE_ADDRESS                _UL_(0x40000c00)                              /* RSTC Base Address */
#define RTC_BASE_ADDRESS                 _UL_(0x40002400)                              /* RTC Base Address */
#define SERCOM0_BASE_ADDRESS             _UL_(0x42000400)                              /* SERCOM0 Base Address */
#define SERCOM1_BASE_ADDRESS             _UL_(0x42000800)                              /* SERCOM1 Base Address */
#define SERCOM2_BASE_ADDRESS             _UL_(0x42000c00)                              /* SERCOM2 Base Address */
#define SERCOM3_BASE_ADDRESS             _UL_(0x42001000)                              /* SERCOM3 Base Address */
#define SERCOM4_BASE_ADDRESS             _UL_(0x42001400)                              /* SERCOM4 Base Address */
#define SERCOM5_BASE_ADDRESS             _UL_(0x42001800)                              /* SERCOM5 Base Address */
#define SUPC_BASE_ADDRESS                _UL_(0x40001800)                              /* SUPC Base Address */
#define TC0_BASE_ADDRESS                 _UL_(0x42001c00)                              /* TC0 Base Address */
#define TC1_BASE_ADDRESS                 _UL_(0x42002000)                              /* TC1 Base Address */
#define TC2_BASE_ADDRESS                 _UL_(0x42002400)                              /* TC2 Base Address */
#define TCC0_BASE_ADDRESS                _UL_(0x42002800)                              /* TCC0 Base Address */
#define TCC1_BASE_ADDRESS                _UL_(0x42002c00)                              /* TCC1 Base Address */
#define TCC2_BASE_ADDRESS                _UL_(0x42003000)                              /* TCC2 Base Address */
#define TCC3_BASE_ADDRESS                _UL_(0x42003400)                              /* TCC3 Base Address */
#define TRAM_BASE_ADDRESS                _UL_(0x42005400)                              /* TRAM Base Address */
#define TRNG_BASE_ADDRESS                _UL_(0x42004400)                              /* TRNG Base Address */
#define USB_BASE_ADDRESS                 _UL_(0x4100a000)                              /* USB Base Address */
#define WDT_BASE_ADDRESS                 _UL_(0x40002000)                              /* WDT Base Address */
/** @}  end of Peripheral Base Address Definitions */

/** \addtogroup PIC32CM1216LE00064_pio Peripheral Pio Definitions
 *  @{
 */

/* ************************************************************************** */
/*   PIO DEFINITIONS FOR PIC32CM1216LE00064                                   */
/* ************************************************************************** */
#include "pio/pic32cm1216le00064.h"
/** @}  end of Peripheral Pio Definitions */

/* ************************************************************************** */
/*   MEMORY MAPPING DEFINITIONS FOR PIC32CM1216LE00064                        */
/* ************************************************************************** */

#define FLASH_SIZE                     _UL_(0x00020000)    /*  128kB Memory segment type: flash */
#define FLASH_PAGE_SIZE                _UL_(        64)
#define FLASH_NB_OF_PAGES              _UL_(      2048)

#define AUX0_SIZE                      _UL_(0x00000100)    /*    0kB Memory segment type: fuses */
#define AUX0_PAGE_SIZE                 _UL_(        64)
#define AUX0_NB_OF_PAGES               _UL_(         4)

#define AUX1_SIZE                      _UL_(0x00000100)    /*    0kB Memory segment type: fuses */
#define AUX1_PAGE_SIZE                 _UL_(        64)
#define AUX1_NB_OF_PAGES               _UL_(         4)

